Repository: msdx/gradle-translation
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: If this is not specified, the default configuration is used (see Section 50.4.9, “Dependency configurations”).
zh_cn: 如果它没有指定，则会使用default 配置（参阅第 50.4.9节，“依赖配置”）。

source: If this is not the behaviour you want for some reason, consider using TaskOutputs.upToDateWhen()
zh_cn: 如果你因为一些理由而不想这样，请考虑使用TaskOutputs.upToDateWhen()

source: If this path is an absolute path, it is used to construct a File instance.
zh_cn: 如果这个路径是一个绝对路径，它会用于构构一个File实例。

source: If this task is configured to use the value from sourceSets.main.output.classesDir, then changing it in this location will update both the compileJava task and this other consumer task whenever it is changed.
zh_cn: 如果这个任务使用sourceSets.main.output.classesDir的值来配置，那么修改了这个位置的值，无论它是什么时候被修改，将同时更新compileJava任务和这一个消费者任务。

source: If versions are unclear you can introduce subtle bugs which are very hard to find.
zh_cn: 如果版本不清楚，你可能引入一些很难找到的微妙的错误。

source: If you are coming from Ant, such an enhanced Gradle task as Copy looks like a mixture between an Ant target and an Ant task.
zh_cn: 如果你是从 Ant 转过来的，像Copy这种增强的 Gradle 任务，看起来就像是一个 Ant 目标（target）和一个 Ant 任务（task）之间的混合物。

source: If you are familiar with the approach used by either Maven or Ivy you will be delighted to learn that Gradle is fully compatible with both approaches in addition to being flexible enough to support fully-customized approaches.
zh_cn: 如果您熟悉使用 Maven 或 Ivy 的方法，那么你会很高兴地知道，Gradle 完全兼容这两种方法，除此之外，它还有足够的灵活性，以支持完全自定义的方法。

source: If you are migrating from a tool like Ant or Maven to Gradle, you may be faced with some difficult situations.
zh_cn: 如果你从一个像 Ant 或 Maven 这样的工具迁移到 Gradle，你可能会面临一些困难的情况。

source: If you are tired of using the same command line options again and again, take a look at Section 20.1, “Configuring the build environment via gradle.properties”.
zh_cn: 如果你已经厌倦反复使用相同的命令行选项，可以看看第 20.1 章节，“通过 gradle.properties 配置构建环境”。

source: If you are using one of the tasks that come with Gradle, such as a task added by the Java plugin, you might have noticed that Gradle will skip tasks that are up-to-date.
zh_cn: 如果您使用 Gradle 自带的任务，如 Java 插件所添加的任务的话，你可能已经注意到 Gradle 将跳过处于最新状态的任务。

source: If you are working with a distributed version control system like Git you probably don't want to use the version control system to store libraries as people check out the whole history.
zh_cn: 如果您是使用像 Git 一样的分布式版本控制系统，由于人们会检出整个历史，你可能不想使用版本控制系统来保存这些库。

source: If you call allprojects with a closure, the statements of the closure are delegated to the projects associated with allprojects.
zh_cn: 如果你使用一个闭包调用allprojects，这个闭包的声明会被委托给与allprojects关联的项目。

source: If you come from Ivy land, you might expect some more fine grained control.
zh_cn: 如果你是从Ivy转过来的，你可能想要一些更细粒度的控制。

source: If you come from Maven land you might be perfectly happy with this.
zh_cn: 如果你是从Maven中转过来的，那么你会对这一点很满意。

source: If you declare a module dependency, Gradle looks for a corresponding module descriptor file (pom.xml or ivy.xml) in the repositories.
zh_cn: 如果你定义了一个模块依赖，Gradle 会在仓库中查找相应的模块描述符文件（pom.xml或ivy.xml）。

source: If you declare with dependsOn a execution dependency between different projects, the default behavior of this method is to create also a configuration dependency between the two projects.
zh_cn: 如果你通过dependsOn声明了不同的项目之间的执行依赖，该方法的默认行为也会创建这两个项目之间的配置依赖。

source: If you define an exclude for a particular configuration, the excluded transitive dependency will be filtered for all dependencies when resolving this configuration or any inheriting configuration.
zh_cn: 如果你为一个特定的配置定义一个 exclude，则解析此配置或任何继承的配置时，对于所有的依赖，所排除的传递依赖将会被过滤掉。

source: If you don't model your dependencies as a hierarchical tree of first-level and second-level dependencies it is very easy to quickly lose control over an assembled mess of unstructured dependencies.
zh_cn: 如果你不把你的依赖作为层次结构树的第一级和第二级依赖的模型，那么在对未组织的依赖进行混乱的组装之后，就会很容易地失去控制。

source: If you don't specify anything explicitly, Gradle uses the default configuration of the dependency.
zh_cn: 如果你不显式指定任何东西，Gradle 会使用依赖的默认配置。

source: If you don't use transitive dependency management, version conflicts are undetected and the often accidental order of the classpath will determine what version of a dependency will win.
zh_cn: 如果你不使用传递依赖管理，版本冲突没被发现，那么在类路径中无法预测的顺序，将导致不知道会使用哪一个版本的依赖。

source: If you don't want this transitive behavior, simply declare your provided dependencies like commons-httpclient:commons-httpclient:3.0@jar.
zh_cn: 如果你不想要这种传递行为，只是把provided依赖声明成和commons-httpclient:commons-httpclient:3.0@jar一样。

source: If you edit them, you are given options to "Always Show Live Output." This only applies if you have 'Only Show Output When Errors Occur'.
zh_cn: 如果你在编辑它们的时候，选上“始终显示实时输出”，它只有在你选上“当发生错误时才显示输出”时有效。

source: If you execute the build from the messages project Gradle executes them both because they have the same name and they are down the hierarchy.
zh_cn: 如果你从 messages 项目执行构建，Gradle 会执行它们两个，因为他们具有相同的名称，并且它们在该层次结构下。

source: If you happen to use additional Sonar plugins, consult their documentation.
zh_cn: 如果你碰巧使用另外的 Sonar 插件，请参考它们的文档。

source: If you have a problem with your build, try temporarily disabling the daemon (you can pass the command line switch --no-daemon).
zh_cn: 如果你的构建有问题，请尝试暂时禁用守护进程 （您可以通过使用命令行开关--no-daemon)。

source: If you have just gotten the latest version of source from your version control system which included changes in other projects that :api depends on, you might want to not only build all the projects you depend on, but test them as well.
zh_cn: 如果你只是刚刚从你的版本控制系统中获取到最新的代码，它包含了:api依赖的其他项目的修改，你可能不只想构建所有你依赖的项目，还想对它们进行测试。

source: If you have more than one artifact to publish, things work a little bit differently.
zh_cn: 如果你有超过一个的artifact 要发布，那么要做的事情就会有些不同。

source: If you haven't had to deal with the curse of conflicting versions of jars on a classpath, here is a small anecdote of the fun that awaits you.
zh_cn: 如果你还没有处理过在类路径中 jar 包版本冲突的麻烦，这里有一个小趣闻等着你。

source: If you make these types of changes, it is not sufficient to test just the :api project, you also need to test all projects that depend on the :api project.
zh_cn: 如果你做这一类的修改，只测试:api 项目并不足够，你还需要测试依赖于:api项目的所有项目。

source: If you manually define a path variable pointing to the Gradle dependency cache, IDEA will automatically replace the absolute dependency paths with this path variable.
zh_cn: 如果您手动定义路径变量来指向 Gradle 依赖缓存，IDEA 会自动把绝对依赖路径替换为此路径变量。

source: If you need to set other properties from the command line, you can use system properties to do so:
zh_cn: 如果你需要从命令行设置其他属性，你可以使用系统属性来做：

source: If you only work with flat directory resolvers you don't need to set all attributes of a dependency.
zh_cn: 如果你只使用平面目录解析器，那么你不需要去设置一个依赖的所有属性。

source: If you run Gradle with the --recompile-scripts option, the cached script is discarded and the script is compiled and stored in the cache.
zh_cn: 如果您通过--recompile-scripts选项运行 Gradle ，会丢弃缓存的脚本，然后重新编译此脚本并将其存在缓存中。

source: If you run this from your Gradle project working directory, you should see a tree of tasks.
zh_cn: 如果你在你的Gradle项目目录下运行Gradle GUI，你应该会看到一个任务树。

source: If you trigger a multiproject build from the directory where the settings file is, things are easy.
zh_cn: 如果你在一个有设置文件的目录中触发一个多项目构建，那很简单。

source: If you try to manage transitive dependencies yourself, the end of the story is that your build becomes brittle: no one dares to change your dependencies because the risk of breaking the build is too high.
zh_cn: 如果你尝试自己管理传递依赖，最终的结果是你的构建会变得很脆弱：没有人敢去改变你的依赖，因为破坏构建的风险太高。

source: If you try using the daemon for your local builds it's going to be hard for you to go back to regular use of Gradle.
zh_cn: 如果你尝试在你的本地构建中使用守护进程的话，它会变得让你很难回到正常的 Gradle 使用。

source: If you upload your project into a repository, this JAR is declared as part of the dependency descriptor.
zh_cn: 如果你把你的项目上传到仓库，这个JAR 文件会被声明为依赖描述符的一部分。

source: If you use Archiva, Nexus, or Artifactory, Gradle is 100% compatible with all repository formats.
zh_cn: 如果你使用 Archiva， Nexus，或者是 Artifactory, Gradle 100% 兼容所有仓库的格式。

source: If you use client modules the dependency declaration in the XML descriptor file is not correct.
zh_cn: 如果你使用了客户端模块，在 XML 描述符文件中的依赖声明就会不正确。

source: If you use such a path variable, you need to configure this path variable via idea.pathVariables, so that it can do a proper merge without creating duplicates.
zh_cn: 如果你使用这种路径变量，您需要通过 idea.pathVariables 配置此路径变量，以便它可以做适当的合并而不会重复创建。

source: If you want to exclude a transitive dependency from all your configurations you can use the Groovy spread-dot operator to express this in a concise way, as shown in the example.
zh_cn: 如果你想要从你的所有配置中排除传递依赖，你可以用简明的方式，使用 Groovy 的 spread-dot 运算符来表示，如这个例子所示例。

source: If you want to get rid of a first level dependency you really can't be sure which other jars you should remove.
zh_cn: 如果你想要摆脱第一级的依赖，你不能真正确定还有哪些 jar 文件你是需要删除的。

source: If you want to make this the default behavior, add tasks.eclipse.dependsOn(cleanEclipse) to your build script.
zh_cn: 如果你想要让它成为默认行为，请将tasks.eclipse.dependsOn(cleanEclipse)添加到构建脚本。

source: If you want to make this the default behavior, add tasks.idea.dependsOn(cleanIdea) to your build script.
zh_cn: 如果你想要让它成为默认行为，请将tasks.idea.dependsOn(cleanIdea)添加到构建脚本中。

source: If you want to tweak where the announcements go, you can configure the announce plugin to change the local announcer.
zh_cn: 如果您想要调整公告的位置，你可以配置 announce 插件来更改本地的announcer。

source: If you want to use a (flat) filesystem directory as a repository, simply type:
zh_cn: 如果你想要把一个（平面）文件系统目录作为仓库使用，只需输入：

source: If you work for example with Maven repositories, you need to define the group, name and version.
zh_cn: 例如，如果你使用 Maven 仓库，你需要定义group，name 和 version。

source: If you work with Ivy repositories and want to declare a non-default configuration for your dependency you have to use the map notation and declare:
zh_cn: 如果你使用 Ivy 存储库，并且想要为你的依赖定义一个非默认配置，就要使用 map 标记法并且声明：

source: If you work with Maven repositories you don't have the flexibility as described above.
zh_cn: 如果你使用 Maven 仓库，由没有如上文所述的灵活性。

source: If you work with filesystem repositories you might only need the name or the name and the version.
zh_cn: 如果你使用文件系统仓库，你可能只需要 name 或 name 和 version。

source: If your application directory doesn't contain a META-INF/application.xml deployment descriptor then one will be generated for you.
zh_cn: 如果你的application目录没有包含META-INF/application.xml部署描述符，那么将会为你生成一个。

source: If your Java application requires a specific set of JVM settings or system properties, you can configure the applicationDefaultJvmArgs property.
zh_cn: 如果你的 Java 应用程序需要一组特定的 JVM 设置或系统属性，你可以配置applicationDefaultJvmArgs属性。

source: If your build only produces one distribution you only need to configure this distribution (or use the defaults).
zh_cn: 如果你的构建只产生一个 distribution，你只需要配置这一个 distribution（或使用默认值）。

source: If your build script relies on optional properties the user might set for example in a gradle.properties file, you need to check for existence before you can access them.
zh_cn: 如果您的构建脚本依赖于一些可选属性，而这些属性用户可能在比如 gradle.properties 文件中设置，您就需要在访问它们之前先检查它们是否存在。

source: If your main concern is bad metadata in the POM file and maintaining custom XML descriptors, Client Modules offer an alternative.
zh_cn: 如果你主要关心的是 POM 文件和维护的自定义 XML 描述符中的元数据不正确，客户端模块提供了一种替代方案。

source: If your project generates files to be included in the distribution, e.g. documentation, you can add these files to the distribution by adding to the applicationDistribution copy spec.
zh_cn: 如果你的项目生成的文件中要在 distrubution 中，例如文档，你可以通过把它们添加到applicationDistribution复制规范，来将这些文件添加到 distribution 中。

source: If your project is supposed to be used as a library, you need to define what are the artifacts of this library and what are the dependencies of these artifacts.
zh_cn: 如果你的项目是作为一个库使用，你需要定义这个库的构件是什么，以及这些构件的依赖。

source: If your project relies on the Maven Central repository you are likely to need an additional custom repository, because:
zh_cn: 如果您的项目依赖于 Maven 中央仓，你很可能需要额外的自定义仓库，因为：

source: If your proxy requires NTLM authentication, you may need to provide the authentication domain as well as the username and password.
zh_cn: 如果您的代理服务器需要 NTLM 身份验证，您可能需要提供验证域，以及用户名和密码。

source: Imagine a releasable unit defined by all libraries that have 'org.gradle' group.
zh_cn: 想象一下，一个可发布的单位，由有“org.gradle” 组的所有库定义。

source: Implementing your own custom task class in Gradle is easy.
zh_cn: 在Gradle中实现你的自定义任务类并不难。

source: Important information messages
zh_cn: 重要的信息消息

source: Importing an Ant build
zh_cn: 导入 Ant 构建

source: Improved HTML reporting, similar to that available for JUnit.
zh_cn: 改进 HTML 报告，类似于 JUnit 提供的那样。

source: In Section 6.5, “Task dependencies” you were introduced to defining dependencies using task names.
zh_cn: 在第 6.5 章节，"任务依赖"中，已经向你介绍了使用任务名称来定义依赖。

source: In Table 18.3, “Stacktrace command-line options” you find the command line switches which affect stacktrace logging.
zh_cn: 在表 18.3，“栈跟踪的命令行选项”中，你可以看到影响栈跟踪日志的命令行开关。

source: In this case there would be an easier solution by reading the key property at execution time.
zh_cn: 在这种情况下，通过在执行时读key属性是一种更简单的解决方案。

source: In Gradle a dependency can have different configurations (as your project can have different configurations).
zh_cn: 在 Gradle ，一个依赖可以有不同的配置 (就像你的项目可以有不同的配置)。

source: In Gradle and Ivy, a module can have multiple artifacts.
zh_cn: 在 Gradle 和 Ivy 中，一个模块可以具有多个 artifacts。

source: In Gradle build scripts are optional.
zh_cn: 在 Gradle 中，构建脚本是可选的。

source: In Gradle dependencies are grouped into configurations.
zh_cn: 在 Gradle 中，依赖被分组到配置中。

source: In Gradle terms this means that you can define tasks and dependencies between tasks.
zh_cn: 用 Gradle 的话说，这意味着您可以定义任务和任务之间的依赖。

source: In Gradle, when you declare a dependency on an Ivy module, you actually declare a dependency on the default configuration of that module.
zh_cn: 在 Gradle 中，当你声明一个对 Ivy 模块的依赖时，实际上你是在那个模块的 default 配置上声明了一个依赖。

source: In Java, there is no standard way to tell the JVM that you are using version 3.0.5 of Hibernate, and there is no standard way to say that foo-1.0.jar depends on bar-2.0.jar.
zh_cn: 在 Java 中，没有标准的方法来告诉 JVM 你使用的是 3.0.5 版本的 Hibernate，也没有标准的方法来表明 foo-1.0.jar 依赖于 bar-2.0.jar。

source: In Maven you can define repositories and optionally snapshot repositories.
zh_cn: 在 Maven 中你可以定义仓库和snapshot仓库。

source: In Maven, a module can have one and only one artifact.
zh_cn: 在 Maven 中，一个模块仅能有一个 artifact。

source: In TestNG you can specify different test groups.
zh_cn: 在 TestNG 中你可以指定不同的测试组。

source: In a future Gradle release, this will become the default.
zh_cn: 在未来的 Gradle 版本中，将把它作为默认设置。

source: In a future edition of this user guide we might write more about this.
zh_cn: 在本用户指南的未来版本中，我们可能会写一下与之有关的更多内容。

source: In a large project with 30 submodules, adding a dependency to a subproject changed the order of a classpath, swapping Spring 2.5 for an older 2.4 version.
zh_cn: 在一个有30个子模块的大型项目中，向子项目添加的一个依赖改变了类路径的顺序， Spring 2.5 与老的 2.4 版本的顺序被交换。

source: In a multi project build, systemProp. properties set in any project except the root will be ignored.
zh_cn: 在多项目构建中，除了在根项目之外的任何项目里的 systemProp.属性集都将被忽略。

source: In a multi-project build, analysis files are passed on to downstream ScalaCompile tasks to enable incremental compilation across project boundaries.
zh_cn: 在多项目构建中，分析文件被传递给下游的ScalaCompile任务，以启用跨项目的增量编译。

source: In a typical setup, analysis would be performed once per day on a build server.
zh_cn: 在典型的设置中，会每天在构建服务器上运行一次分析。

source: In addition to supporting a traditional command line interface, Gradle offers a graphical user interface.
zh_cn: 除了支持传统的命令行界面，Gradle也提供了一个图形用户界面（GUI）。

source: In addition, user interfaces can provide some interesting features if the Gradle model can be built relatively quickly.
zh_cn: 此外，如果可以相对较快地建立 Gradle 模型，用户界面可以提供一些有趣的功能。

source: In an enterprise environment this is rather common.
zh_cn: 在企业环境中，这是相当普遍的。

source: In both cases, all fork options specified with options.forkOptions will be honored.
zh_cn: 在这两种情况下，使用options.forkOptions指定的所有fork选项都将得到重视。

source: In case of version conflicts between dependencies of the subset and dependencies not belonging to the subset the resolve result might be different.
zh_cn: 在子集的依赖和不属于子集的依赖之间，存在版本冲突的情况下，解析的结果可能会有所不同。

source: In case this property does not exists, an exception is thrown and the build fails.
zh_cn: 如果此属性不存在，则会引发异常，并且构建失败。

source: In case you don't want to use the test class detection, you can disable it by setting scanForTestClasses to false.
zh_cn: 如果你不想要使用测试类检测，可以通过设置scanForTestClasses为 false 来禁用它。

source: In configuration on demand mode projects are configured as follows:
zh_cn: 在按需配置的模式下项目会如下配置︰

source: In contrast to Maven, where this path is fixed, with Gradle you can define a pattern that defines what the path will look like.
zh_cn: 相比于固定路径的 Maven，使用 Gradle 你可以定义一个模式，该模式定义了路径的样子。

source: In contrast to the command line reports, the report plugin generates the reports into a file.
zh_cn: 与命令行报告相比，报告插件将报告生成到一个文件中。

source: In doing so, Gradle enables reliable and reproducible enterprise builds.
zh_cn: 在此过程中，Gradle 实现了可靠和可重复的的企业构建。

source: In dynamic resolve mode, Gradle will instead prefer the revConstraint attribute over the rev attribute for a given dependency definition.
zh_cn: 在动态解析模式中，Gradle 将优先使用revConstraint属性来代替rev属性，用于一个给定的依赖定义。

source: In each case, the tool chain will target the current operating system.
zh_cn: 在每种情况中，工具链将针对当前的操作系统。

source: In every other respect, a Groovy project is identical to a Java project, which we have already seen in Chapter 7, Java Quickstart.
zh_cn: 在其他各方面，Groovy项目与我们在第七章Java快速入门中所看到的Java项目几乎相同 。

source: In example below, imagine that version 1.2.1 contains important fixes and should always be used in preference to 1.2.
zh_cn: 在下面的示例中，想象版本1.2.1包含了重要的修复程序，并应始终优先于1.2使用。

source: In fact, Gradle's deployment is 100 percent Maven compatible as we use the native Maven Ant tasks under the hood.
zh_cn: 事实上，Gradle 的部署是 100%兼容 Maven的，因为我们在hood下使用的是本地的 Maven Ant 任务。

source: In fact, a configuration can contain both artifacts and dependencies at the same time.
zh_cn: 事实上，配置可以同时包含构件和依赖。

source: In fact, some of those repositories allow only for artifact downloading.
zh_cn: 实际上，有些仓库只允许下载构件。

source: In fact, you will find that it's far easier and more powerful using Ant tasks in a Gradle build script, than it is to use Ant's XML format.
zh_cn: 事实上，你会发现在 Gradle 中使用 Ant 任务比使用 Ant 的XML 格式更容易也更强大。

source: In future the daemon will offer more features:
zh_cn: 未来，该守护进程还会提供更多的功能：

source: In general, snappy behavior of the build tool is always handy.
zh_cn: 一般情况下，构建工具的敏捷行为总是可以派上用场。

source: In general, using Groovy is the easiest option, because the Gradle API is designed to work well with Groovy.
zh_cn: 一般情况下，使用Groovy是最简单的选择，因为Gradle API就是被设计为能使用Groovy良好地执行。

source: In majority of cases the project path is consistent with the physical location of the project in the file system.
zh_cn: 在大多数情况下，项目路径是符合在文件系统中项目的物理位置的。

source: In many cases, more than one native binary can be produced for a component.
zh_cn: 在许多情况下，一个组件可以产生超过一个的原生二进制文件。

source: In most cases, Gradle's default dependency management will resolve the dependencies that you want in your build.
zh_cn: 在大多数情况下，Gradle 的默认依赖管理将会在你的构建中按你所想的解析依赖关系。

source: In multi-project builds you may often want to do all of these tasks across a range of projects.
zh_cn: 在多项目构建中，你可能经常想跨多项目范围执行这些任务。

source: In order to create PGP signatures, you will need a key pair (instructions on creating a key pair using the GnuPG tools can be found in the GnuPG HOWTOs).
zh_cn: 为了创建 PGP 签名，你将需要一个密钥对（有关使用GnuPG 工具创建密钥对的介绍可以在GnuPG Howto中找到）。

source: In other words, a standard Maven snapshot is a module that never stands still so to speak, it is a "changing module".
zh_cn: 换句话说，一个标准的 Maven snapshot 是一个这样的模块，它永远不会不变，可以说，它是“不断变化的模块”。

source: In other words, everything except the Ant tasks and types.
zh_cn: 换句话说，除了 Ant 任务和类型之外全部都有。

source: In our examples, we are going to use Groovy as the implementation language, but you could use, for example, Java or Scala.
zh_cn: 在我们的例子中，我们将使用Groovy来作为实现的语言，但你也可以使用Java或者是Scala。

source: In our examples, we will start with the task class in the build script, to keep things simple.
zh_cn: 在我们的例子中，为了简单，我们将从在构建脚本中定义任务类开始。

source: In our next release we want to enable partial builds from subprojects by specifying the location of the settings file as a command line parameter.
zh_cn: 在我们下一版本中，我们想通过在命令行参数中，指定一个设置文件的路径，来从子项目中启用部分的构建。

source: In particular, only the Sonar Runner plugin supports Sonar 3.4 and higher.
zh_cn: 尤其是因为只有 Sonar Runner 插件支持 Sonar 3.4 及更高的版本。

source: In return, you get total control over the generated file, including sections not modeled by the domain objects.
zh_cn: 作为回报，你可以对生成的文件进行全面的控制，包括未由域对象建模的那些部分。

source: In short, version conflicts are bad, and you should manage your transitive dependencies to avoid them.
zh_cn: 总之，版本冲突是很不好的，你应该管理你的传递依赖，以避免它们。

source: In some cases it is useful to control the order in which 2 tasks will execute, without introducing an explicit dependency between those tasks.
zh_cn: 在某些情况下，控制两个任务的执行的顺序，而不引入这些任务之间的显式依赖，是很有用的。

source: In some cases the artifact that you need to sign may not be part of a configuration.
zh_cn: 在某些情况下，你需要签名的artifact 可能不是配置的一部分。

source: In some cases, however, it can be necessary to tweak dependency resolution to ensure that your build receives exactly the right dependencies.
zh_cn: 然而，在某些情况下，会有必要调整依赖解析，以确保你的构建能得到正确的依赖关系。

source: In some corporate environments, the list of module versions that can be declared in gradle builds is maintained and audited externally.
zh_cn: 在一些企业的环境中，可以声明在 gradle 构建中的模块版本列表，是在外部维护和审核的。

source: In such a case you can use the path notation of the pattern, so that the pattern is applied only to the test task of a specific subproject.
zh_cn: 在这种情况下你可以使用路径标记法的模式，这样该模式就会只应用于特定的子项目的测试任务中。

source: In such a case you need to generate multiple POMs. In such a case you have to explicitly declare each artifact you want to publish to a Maven repository.
zh_cn: 在这种情况下，你需要生成多个 POMs。在这种情况下，你必须显式声明你想要发布到一个 Maven 仓库的每一个构件。

source: In such a scenario, the custom task should sufficiently declare the inputs/outputs relevant to the copy action.
zh_cn: 在这种情况下，自定义任务应充分声明与复制操作有关的输入/输出。

source: In the above case, we are using the short name ‘java’ to apply the JavaPlugin.
zh_cn: 在上述例子中，我们使用短名称java去应用JavaPlugin。

source: In the build file of the water project we use an afterEvaluate notification.
zh_cn: 在这个water项目的构建文件中，我们使用了一个afterEvaluate通知。

source: In the build script, the developer declares dependencies with the module group and name, but uses a placeholder version, for example: 'default'.
zh_cn: 在构建脚本中，开发人员使用模块组与名称声明依赖，但使用占位符版本，例如：“default”。

source: In the case of the Ant javac task, this means that a new process will be forked for each compile task, which can slow down compilation.
zh_cn: 在 Ant javac 任务中，这意味着将会为每一个compile任务fork一个新的进程，而这将会使编译变慢。

source: In the current release client modules have one limitation.
zh_cn: 在当前版本客户端模块有一个缺陷。

source: In the example above repository and authentication are such bean elements.
zh_cn: 在上例中repository和authentication都是这样的 bean 元素。

source: In the example above, orca has a dependency on seal-1.0 whereas shark has a dependency onseal-2.0.
zh_cn: 在上面的例子中 orca 依赖 seal-1.0 而 shark 依赖于 seal-2.0。

source: In the example above, a library is defined with a 'english' and 'french' flavor.
zh_cn: 在上面的示例中，library 定义了“english”和“french”两个flavor。

source: In the example above, the content of the "src/readme" directory will be included in the distribution (along with the files in the "src/dist/main" directory which are added by default).
zh_cn: 在上面的示例中，”src/readme“目录的内容将被包含进 distribution（与默认添加的”src/dist/main“目录中的文件一起）。

source: In the example above, we changed the desired location of the class files after this conventional configuration had been performed.
zh_cn: 在上面例子中，我们在约定配置被执行之后，修改了类文件所需的位置。
